tutorials-OpenFOAM-5.0/multiRegionReactingFoam/multiRegionReactingFoamTutorial/constant/bottomAir/reactions
species
(
    O2
    N2
);

reactions
{
}
