tutorials-OpenFOAM-5.0/multiRegionReactingFoam/multiRegionReactingFoamTutorial/constant/topAir/viewFactorsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viewFactorsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


writeViewFactorMatrix     true;
writeFacesAgglomeration   true;
writePatchViewFactors     false;

topAir_to_heater
{
    nFacesInCoarsestLevel     24;
    featureAngle              10;
}

topAir_to_leftSolid
{
    nFacesInCoarsestLevel     20;
    featureAngle              10;
}

topAir_to_rightSolid
{
    nFacesInCoarsestLevel     20;
    featureAngle              10;
}

minX
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}

maxY
{
    nFacesInCoarsestLevel     40;
    featureAngle              10;
}

minZ
{
    nFacesInCoarsestLevel     20;
    featureAngle              10;
}

maxX
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}

maxZ
{
    nFacesInCoarsestLevel     20;
    featureAngle              10;
}


// ************************************************************************* //
